{
  "jobs": [
    {
      "title": "Founding UX Designer",
      "location": "Rubixvi • Singapore | Remote",
      "summary": "We are looking for a UX Designer to join the founding product team at Rubixvi to help build a new digital health platform.",
      "description": [
        "This is a chance to shape the product from the inside out, not just how it looks but how it works. You will be the first internal designer on the team, with the opportunity to define flows, create systems, and help build something that truly matters.",
        "We care about design that is practical, clean, and centered around real users. You will work closely with engineers, product leads, and stakeholders to make sure what we build is thoughtful, usable, and scalable.",
        "You will work directly with experts who bring decades of experience in product delivery and deep expertise in the medical field. This is a chance to learn, grow, and contribute to a transformative product that aims to make a real impact."
      ],
      "requirements": [
        "4 or more years of experience in UX or UI design",
        "Strong portfolio showing mobile first design work for iOS and Android",
        "Proficiency in Figma for interface design, prototyping, and design systems",
        "Solid grasp of interaction patterns, accessibility, and responsive design",
        "Able to produce and maintain developer ready design documentation",
        "Familiar with working closely with developers and product leads",
        "Excellent written and verbal communication in English"
      ],
      "whoYouAre": [
        "You are driven by problems, not just pixels",
        "You collaborate well across disciplines",
        "You enjoy working within constraints and iterating with feedback",
        "You value clarity in your designs, documentation, and communication",
        "You take ownership but are not precious about your work",
        "You want to build something that helps people in real life"
      ],
      "whatYouWillDo": [
        "Design and evolve the core experience across mobile and web",
        "Build and maintain a modular design system in Figma",
        "Define user flows, structure information, and shape interactions",
        "Work closely with engineers and product leads to ship features",
        "Produce high quality documentation and design specifications",
        "Join product discussions and help shape priorities and decisions"
      ],
      "contractSetup": [
        "Full-time remote position",
        "Reporting to product leadership, working directly with frontend and backend engineers"
      ]
    },
    {
      "title": "Lead App Developer",
      "location": "Rubixvi • Singapore | Remote",
      "summary": "As Lead App Developer at Rubixvi, you'll drive the technical vision and hands-on development of our new digital health platform.",
      "description": [
        "Lead the development of our mobile and web applications, working closely with product, design, and fellow developers to bring Rubixvi’s digital health platform to life. You'll help shape the architecture, set technical direction, and guide a small engineering team in shipping features that make a real difference."
      ],
      "requirements": [
        "6+ years of experience in software development",
        "Strong knowledge of React and React Native",
        "Experience with at least one backend language (Node.js or Python preferred)",
        "Proficiency with TypeScript and API integration",
        "Track record of building and maintaining production web or mobile apps",
        "Familiarity with git workflows, CI/CD pipelines, and deployments",
        "Experience mentoring or leading engineering teammates",
        "Comfortable collaborating with product and design from concept to delivery",
        "Strong communication skills in English",
        "Exposure to startup environments and zero-to-one product launches",
        "Familiarity with authentication, analytics, and mobile deployments (App Store, Play Store)"
      ],
      "whoYouAre": [
        "You lead by doing and enjoy building things that help people",
        "You thrive in ambiguous, early-stage environments",
        "You work well with designers and product leads to create great user experiences",
        "You communicate clearly and enjoy talking through tradeoffs",
        "You take ownership of delivery, not just code",
        "You enjoy working in small, high-trust teams"
      ],
      "whatYouWillDo": [
        "Lead the development of Rubixvi’s mobile and web applications",
        "Define architecture, tooling, and engineering best practices",
        "Collaborate with product and design on features, flows, and priorities",
        "Write, review, and ship clean, scalable code",
        "Mentor mid-level engineers and build strong team culture",
        "Set up deployment pipelines for speed and reliability",
        "Support QA, testing, and technical documentation"
      ],
      "contractSetup": [
        "Full-time position, fully remote",
        "Report to product leadership and work alongside engineers, QA, and designers"
      ]
    },
    {
      "title": "Mid-Level Frontend Developer",
      "location": "Rubixvi • Singapore | Remote",
      "summary": "As a Mid-Level Frontend Developer at Rubixvi, you’ll help build user-facing features for of our new digital health platform.",
      "description": [
        "Work with a small, talented team to build and evolve our mobile and web apps. You'll collaborate closely with product, design, and backend teammates, owning features from idea to launch. This is a hands-on role focused on delivering clean code, intuitive UI, and reliable experiences for people who need them."
      ],
      "requirements": [
        "3+ years of experience in modern frontend development",
        "Solid experience with React and TypeScript",
        "Experience with React Native or strong willingness to learn",
        "Ability to build responsive layouts and smooth mobile interactions",
        "Familiar with git, PRs, CI, and code review workflows",
        "Comfortable working with design and backend teams",
        "Attention to code quality, performance, and maintainability",
        "Good written and spoken English",
        "Experience with mobile-first products"
      ],
      "whoYouAre": [
        "You care about user experience as much as code",
        "You like working with designers and getting details right",
        "You enjoy building UI that feels smooth and well-integrated",
        "You take ownership and are reliable with delivery",
        "You work well in teams — you listen, speak up, and collaborate",
        "You like startups and are comfortable with pace and variety"
      ],
      "whatYouWillDo": [
        "Build and maintain user-facing features for mobile and web",
        "Translate designs and ideas into working interfaces",
        "Integrate APIs and collaborate with backend engineers",
        "Write clean, maintainable, reusable code using React and React Native",
        "Participate in reviews, planning, and delivery discussions",
        "Help improve our frontend tooling and performance"
      ],
      "contractSetup": [
        "Full-time remote position",
        "Work with product leadership, senior engineers, and design team"
      ]
    },
    {
      "title": "Project Manager – Core Product Team",
      "location": "Rubixvi • Singapore | Remote",
      "summary": "As Project Manager at Rubixvi, you’ll help keep our core product team focused, organized, and delivering—without adding unnecessary process.",
      "description": [
        "Work side-by-side with product, design, and engineering to track delivery, unblock issues, and make sure everyone has what they need to do their best work. You’re there to reduce noise, keep the team aligned, and help things move smoothly as we build out Rubixvi’s digital health platform."
      ],
      "requirements": [
        "4+ years of experience as a project or delivery manager",
        "Experience working with product, design, and engineering teams",
        "Comfortable managing sprints, delivery tracking, and prioritization",
        "Familiar with Jira, Linear, or other task management tools",
        "Able to lead stand-ups, retros, and planning sessions without overcomplicating them",
        "Strong communicator—clear in Slack, Notion, docs, and meetings",
        "Familiar with agile and lean delivery models",
        "Strong written and spoken English",
        "Bonus: Experience in healthtech, SaaS, or service platforms",
        "Bonus: Worked in remote-first or async-first teams",
        "Bonus: Experience supporting or defining product roadmaps"
      ],
      "whoYouAre": [
        "You help teams deliver—not just track work",
        "You’re organized but flexible, adapting to how the team works best",
        "You bring clarity and reduce ambiguity",
        "Devs trust you and stakeholders respect your updates",
        "You keep things moving but don’t need to be the center of attention",
        "You stay calm under pressure and are helpful when things go wrong"
      ],
      "whatYouWillDo": [
        "Structure and maintain the team’s delivery schedule",
        "Track feature progress, highlight risks, and follow up on blockers",
        "Facilitate sprint planning, retrospectives, and alignment meetings",
        "Coordinate across product, design, and engineering",
        "Own delivery tracking in Jira, Linear, or similar tools",
        "Keep documentation of what’s being built, shipped, or delayed up to date",
        "Help onboard new team members and organize resources"
      ],
      "contractSetup": [
        "Full-time remote position",
        "Work closely with product leadership, engineering, and design",
        "Focused on product delivery and team efficiency"
      ]
    },
    {
      "title": "Operations Manager",
      "location": "Rubixvi • Singapore | Remote",
      "summary": "As Operations Manager at Rubixvi, you'll become the operational backbone of our fast-developing healthcare company.",
      "description": [
        "Lead operational excellence across all departments while scaling our healthcare innovation platform. You'll streamline processes, manage cross-functional initiatives, and ensure our team operates at peak efficiency as we revolutionize global healthcare delivery."
      ],
      "requirements": [
        "4+ years of operations experience in fast-growing startups",
        "Experience scaling teams and processes in healthcare or similar regulated industries",
        "Strong analytical skills and data-driven decision making",
        "Good at finding new talent and guiding",
        "Excellent project management and cross-functional collaboration skills"
      ],
      "whoYouAre": [
        "You thrive in ambiguous, fast-paced environments",
        "You're passionate about building systems that scale",
        "You believe in the transformative power of healthcare technology",
        "You're detail-oriented but never lose sight of the big picture"
      ],
      "whatYouWillDo": [
        "Design and implement operational frameworks across all departments",
        "Lead cross-functional initiatives to drive company-wide efficiency",
        "Build partnerships and vendor relationships critical to our mission",
        "Establish metrics and KPIs to measure operational success"
      ],
      "contractSetup": [
        "Full-time position with equity participation",
        "Hybrid work arrangements available"
      ]
    }
  ]
}
